fun main(args: Array<String>) {
    // Создать приложение, которое подсчитывает количество подряд идущих одинаковых символов во введенной строке.
    // На вход подается, например, строка AAADSSSRRTTHAAAA. На выходе получаем A3DS3R2T2HA4.
    // То есть, если количество подряд идущих символов меньше двух, то мы не пишем единицу.
    println("Данная программа при вводе строки определяет подряд идущие одинаковые символы и записывает число такого символа")
    println("Введите строку из символов: "); val str = readln()

    // for (i in 0 <= .. <= str.length - 1) {
    //     print(str[i]);
    // }

}